Revit 2027 API
Document.GetDefaultElementTypeId Method
 Gets the default element type id with the given DefaultElementType id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetDefaultElementTypeId(
	ElementTypeGroup defaultTypeId
)
Public Function GetDefaultElementTypeId (
	defaultTypeId As ElementTypeGroup
) As ElementId
public:
ElementId^ GetDefaultElementTypeId(
	ElementTypeGroup defaultTypeId
)
member GetDefaultElementTypeId :
        defaultTypeId : ElementTypeGroup -> ElementId
Parameters
defaultTypeId ElementTypeGroup
 The default element type id.
Return Value
ElementId
 The element type id.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Example
private bool IsWallUsingDefaultType(Document document, Wall wall)
{
    ElementId defaultElementTypeId = document.GetDefaultElementTypeId(ElementTypeGroup.WallType);
    return (wall.WallType.Id == defaultElementTypeId);
}
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace